rails/source_api/app/controllers/orders_controller.rb

INSERT INTO `orders` (`id`, `amount`, `created_at`, `customer_id`, `status`, `updated_at`) VALUES ('019f55cb-4a8e-7736-9d3c-3557f0f2012b', 1980.0, '2026-07-12 10:06:54.094397', 'c1', 'created', '2026-07-12 10:06:54.094397')
INSERT INTO `outbox` (`aggregate_id`, `created_at`, `event_id`, `event_type`, `payload`, `published`) VALUES ('019f55cb-4a8e-7736-9d3c-3557f0f2012b', '2026-07-12 10:06:54.130405', '019f55cb-4a9c-7b40-931f-59aae117aae3', 'order.created', '{\"id\":\"019f55cb-4a8e-7736-9d3c-3557f0f2012b\",\"customer_id\":\"c1\",\"amount\":\"1980.00\",\"status\":\"created\",\"created_at\":\"2026-07-12T10:06:54.094397Z\"}', FALSE)
---
  def create
    order = Order.create_with_outbox!(
      customer_id: params[:customer_id].to_s,
      amount: params[:amount].to_s
    )